# BuiltInFailures.MirrorFailures Class

---
Failures about Mirror.
SystemObject Autodesk.Revit.DBBuiltInFailuresMirrorFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class MirrorFailures

    Public NotInheritable Class MirrorFailures

    public ref class MirrorFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type MirrorFailures = class end
The BuiltInFailuresMirrorFailures type exposes the following members.
| Name| Description
---|---|---
| BadMirror|  Can't mirror element into this position.
Top
#### Reference
Autodesk.Revit.DB Namespace